In [1]:
import pandas as pd
import numpy as np
import pandas_datareader.data as web

c:\python\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [2]:
#Reindexing: create new object with the data conformed to a new index
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a','b','c','d'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [4]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [5]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','b','c'],columns = ['Ohio', "Texas", "California"] )
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [6]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

**Dropping Entries from an Axis**

In [7]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [8]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [9]:
frame2.drop(['Texas', "Ohio"], axis='columns')

   California
a         2.0
b         5.0
c         8.0
d         NaN

In [10]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

**Indexing, Selection and Filtering**

In [11]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.loc["Colorado", ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [13]:
data.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

**Integer Indexes**

In [14]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [15]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [16]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
.....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.495048 -0.724678 -0.415462
Ohio    0.305260 -1.757562 -0.367595
Texas   0.885369 -0.983440 -0.789919
Oregon -1.513561  1.076663 -1.659662

In [17]:
f = lambda x: x.max()-x.min()
frame.apply(f)

b    2.398930
d    2.834226
e    1.292067
dtype: float64

In [18]:
frame.apply(f, axis='columns')

Utah      1.219726
Ohio      2.062822
Texas     1.868809
Oregon    2.736325
dtype: float64

In [19]:
format = lambda x: '%.2f' % x
frame.applymap(format)#elementwise

            b      d      e
Utah     0.50  -0.72  -0.42
Ohio     0.31  -1.76  -0.37
Texas    0.89  -0.98  -0.79
Oregon  -1.51   1.08  -1.66

**Sorting and Ranking**

In [20]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [21]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
.....: index=['three', 'one'],
.....: columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [22]:
frame.sort_index(axis=1, ascending="False")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [23]:
frame.sort_values(by='b')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [24]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [25]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

**Axis Indexes with Duplicate Labels**

In [26]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [27]:
obj.index.is_unique

False

**5.3 Summarizing and Computing Descriptive Statistics**

In [28]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [29]:
df.sum()#Calculate Sum for each column

one    9.25
two   -5.80
dtype: float64

In [30]:
df.sum(axis='columns')#Calculate sum for each row, axis = 1 will do

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [31]:
df.sum(axis = 1, skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

![sum function](sum.png)

In [32]:
df.idxmax()#return index where max is found

one    b
two    d
dtype: object

In [33]:
df.cumsum()#accumulation

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [34]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [35]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

![Statistical Methods](statmethod.png)

**Correlation and Covariance**

In [4]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [6]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-05-19 -0.005778 -0.010447 -0.006922 -0.007554
2020-05-20  0.019448  0.009061  0.013871  0.024198
2020-05-21 -0.007455 -0.018619 -0.012011 -0.002787
2020-05-22  0.006438 -0.006128  0.000436  0.005432
2020-05-26 -0.006774  0.028465 -0.010572  0.004679

In [8]:
returns['MSFT'].corr(returns['IBM'])#Correlation

0.5980120236275744

In [9]:
returns['MSFT'].cov(returns['IBM'])#Covariance

0.00016231409041853065

In [10]:
#Another way to write
returns.MSFT.corr(returns.IBM)

0.5980120236275744

In [11]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.532162  0.711200  0.642323
IBM   0.532162  1.000000  0.598012  0.528959
MSFT  0.711200  0.598012  1.000000  0.750967
GOOG  0.642323  0.528959  0.750967  1.000000

In [12]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000328  0.000152  0.000222  0.000199
IBM   0.000152  0.000249  0.000162  0.000143
MSFT  0.000222  0.000162  0.000296  0.000221
GOOG  0.000199  0.000143  0.000221  0.000293

In [14]:
returns.corrwith(returns.IBM)#pair-wise correlation

AAPL    0.532162
IBM     1.000000
MSFT    0.598012
GOOG    0.528959
dtype: float64

In [15]:
returns.corrwith(volume)#matching column names

AAPL   -0.140957
IBM    -0.104855
MSFT   -0.066511
GOOG   -0.038479
dtype: float64

**Unique Values, Value Counts, and Membership**

In [16]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [17]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [19]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [20]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [21]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [22]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [23]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [25]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int32)

![Table 5-9](unique.png)